platformio/platform-ststm32/misc/svd/STM32L062.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>Firewall</name>
         <description>Firewall</description>
         <groupName>Firewall</groupName>
         <baseAddress>0x40011C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>FIREWALL_CSSA</name>
               <displayName>FIREWALL_CSSA</displayName>
               <description>Code segment start address</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADD</name>
                     <description>code segment start address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIREWALL_CSL</name>
               <displayName>FIREWALL_CSL</displayName>
               <description>Code segment length</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LENG</name>
                     <description>code segment length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIREWALL_NVDSSA</name>
               <displayName>FIREWALL_NVDSSA</displayName>
               <description>Non-volatile data segment start           address</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADD</name>
                     <description>Non-volatile data segment start               address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIREWALL_NVDSL</name>
               <displayName>FIREWALL_NVDSL</displayName>
               <description>Non-volatile data segment           length</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LENG</name>
                     <description>Non-volatile data segment               length</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIREWALL_VDSSA</name>
               <displayName>FIREWALL_VDSSA</displayName>
               <description>Volatile data segment start           address</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADD</name>
                     <description>Volatile data segment start               address</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIREWALL_VDSL</name>
               <displayName>FIREWALL_VDSL</displayName>
               <description>Volatile data segment length</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LENG</name>
                     <description>Non-volatile data segment               length</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIREWALL_CR</name>
               <displayName>FIREWALL_CR</displayName>
               <description>Configuration register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VDE</name>
                     <description>Volatile data execution</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VDS</name>
                     <description>Volatile data shared</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPA</name>
                     <description>Firewall pre alarm</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>RCC</name>
         <description>Reset and clock control</description>
         <groupName>RCC</groupName>
         <baseAddress>0x40021000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RCC</name>
            <description>RCC global interrupt</description>
            <value>4</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Clock control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000300</resetValue>
               <fields>
                  <field>
                     <name>PLLRDY</name>
                     <description>PLL clock ready flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PLLON</name>
                     <description>PLL enable bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RTCPRE</name>
                     <description>TC/LCD prescaler</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CSSLSEON</name>
                     <description>Clock security system on HSE enable               bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSEBYP</name>
                     <description>HSE clock bypass bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSERDY</name>
                     <description>HSE clock ready flag</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSEON</name>
                     <description>HSE clock enable bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MSIRDY</name>
                     <description>MSI clock ready flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MSION</name>
                     <description>MSI clock enable bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSI16DIVF</name>
                     <description>HSI16DIVF</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI16DIVEN</name>
                     <description>HSI16DIVEN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSI16RDYF</name>
                     <description>Internal high-speed clock ready               flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSI16KERON</name>
                     <description>High-speed internal clock enable bit for               some IP kernels</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI16ON</name>
                     <description>16 MHz high-speed internal clock               enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSI16OUTEN</name>
                     <description>16 MHz high-speed internal clock output               enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICSCR</name>
               <displayName>ICSCR</displayName>
               <description>Internal clock sources calibration           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <resetValue>0x0000B000</resetValue>
               <fields>
                  <field>
                     <name>MSITRIM</name>
                     <description>MSI clock trimming</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MSICAL</name>
                     <description>MSI clock calibration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MSIRANGE</name>
                     <description>MSI clock ranges</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSI16TRIM</name>
                     <description>High speed internal clock               trimming</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSI16CAL</name>
                     <description>nternal high speed clock               calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRRCR</name>
               <displayName>CRRCR</displayName>
               <description>Clock recovery RC register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSI48CAL</name>
                     <description>48 MHz HSI clock               calibration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI48RDY</name>
                     <description>48MHz HSI clock ready flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HSI48ON</name>
                     <description>48MHz HSI clock enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSI48DIV6EN</name>
                     <description>48 MHz HSI clock divided by 6 output               enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFGR</name>
               <displayName>CFGR</displayName>
               <description>Clock configuration register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MCOPRE</name>
                     <description>Microcontroller clock output               prescaler</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MCOSEL</name>
                     <description>Microcontroller clock output               selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PLLDIV</name>
                     <description>PLL output division</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PLLMUL</name>
                     <description>PLL multiplication factor</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PLLSRC</name>
                     <description>PLL entry clock source</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>STOPWUCK</name>
                     <description>Wake-up from stop clock               selection</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PPRE2</name>
                     <description>APB high-speed prescaler               (APB2)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PPRE1</name>
                     <description>APB low-speed prescaler               (APB1)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HPRE</name>
                     <description>AHB prescaler</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SWS</name>
                     <description>System clock switch status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SW</name>
                     <description>System clock switch</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIER</name>
               <displayName>CIER</displayName>
               <description>Clock interrupt enable           register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CSSLSE</name>
                     <description>LSE CSS interrupt flag</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSI48RDYIE</name>
                     <description>HSI48 ready interrupt flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MSIRDYIE</name>
                     <description>MSI ready interrupt flag</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PLLRDYIE</name>
                     <description>PLL ready interrupt flag</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSERDYIE</name>
                     <description>HSE ready interrupt flag</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HSI16RDYIE</name>
                     <description>HSI16 ready interrupt flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSERDYIE</name>
                     <description>LSE ready interrupt flag</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSIRDYIE</name>
                     <description>LSI ready interrupt flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
