platformio/platform-ststm32/misc/svd/STM32L062.svd
            <register>
               <name>APB1ENR</name>
               <displayName>APB1ENR</displayName>
               <description>APB1 peripheral clock enable           register</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1EN</name>
                     <description>Low power timer clock enable               bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DACEN</name>
                     <description>DAC interface clock enable               bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWREN</name>
                     <description>Power interface clock enable               bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSEN</name>
                     <description>Clock recovery system clock enable               bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBEN</name>
                     <description>USB clock enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2EN</name>
                     <description>I2C2 clock enable bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1EN</name>
                     <description>I2C1 clock enable bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1EN</name>
                     <description>LPUART1 clock enable bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2EN</name>
                     <description>UART2 clock enable bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2EN</name>
                     <description>SPI2 clock enable bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGEN</name>
                     <description>Window watchdog clock enable               bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM6EN</name>
                     <description>Timer 6 clock enable bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2EN</name>
                     <description>Timer2 clock enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM3EN</name>
                     <description>Timer3 clock enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM7EN</name>
                     <description>Timer 7 clock enable bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART4EN</name>
                     <description>USART4 clock enable bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART5EN</name>
                     <description>USART5 clock enable bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3EN</name>
                     <description>I2C3 clock enable bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IOPSMEN</name>
               <displayName>IOPSMEN</displayName>
               <description>GPIO clock enable in sleep mode           register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000008F</resetValue>
               <fields>
                  <field>
                     <name>IOPHSMEN</name>
                     <description>IOPHSMEN</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPDSMEN</name>
                     <description>IOPDSMEN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPCSMEN</name>
                     <description>IOPCSMEN</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPBSMEN</name>
                     <description>IOPBSMEN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPASMEN</name>
                     <description>IOPASMEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IOPESMEN</name>
                     <description>Port E clock enable during Sleep mode               bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHBSMENR</name>
               <displayName>AHBSMENR</displayName>
               <description>AHB peripheral clock enable in sleep mode           register</description>
               <addressOffset>0x40</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x01111301</resetValue>
               <fields>
                  <field>
                     <name>CRYPSMEN</name>
                     <description>Crypto clock enable during sleep mode               bit</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNGSMEN</name>
                     <description>Random Number Generator clock enable               during sleep mode bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TOUCHSMEN</name>
                     <description>Touch Sensing clock enable during sleep               mode bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCSMEN</name>
                     <description>CRC clock enable during sleep mode               bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAMSMEN</name>
                     <description>SRAM interface clock enable during sleep               mode bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MIFSMEN</name>
                     <description>NVM interface clock enable during sleep               mode bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMASMEN</name>
                     <description>DMA clock enable during sleep mode               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2SMENR</name>
               <displayName>APB2SMENR</displayName>
               <description>APB2 peripheral clock enable in sleep mode           register</description>
               <addressOffset>0x44</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00405225</resetValue>
               <fields>
                  <field>
                     <name>DBGSMEN</name>
                     <description>DBG clock enable during sleep mode               bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SMEN</name>
                     <description>USART1 clock enable during sleep mode               bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI1SMEN</name>
                     <description>SPI1 clock enable during sleep mode               bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCSMEN</name>
                     <description>ADC clock enable during sleep mode               bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM22SMEN</name>
                     <description>TIM22 timer clock enable during sleep               mode bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM21SMEN</name>
                     <description>TIM21 timer clock enable during sleep               mode bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYSCFGSMEN</name>
                     <description>System configuration controller clock               enable during sleep mode bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1SMENR</name>
               <displayName>APB1SMENR</displayName>
               <description>APB1 peripheral clock enable in sleep mode           register</description>
               <addressOffset>0x48</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0xB8E64A11</resetValue>
               <fields>
                  <field>
                     <name>LPTIM1SMEN</name>
                     <description>Low power timer clock enable during               sleep mode bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DACSMEN</name>
                     <description>DAC interface clock enable during sleep               mode bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRSMEN</name>
                     <description>Power interface clock enable during               sleep mode bit</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRSSMEN</name>
                     <description>Clock recovery system clock enable               during sleep mode bit</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USBSMEN</name>
                     <description>USB clock enable during sleep mode               bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2SMEN</name>
                     <description>I2C2 clock enable during sleep mode               bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SMEN</name>
                     <description>I2C1 clock enable during sleep mode               bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SMEN</name>
                     <description>LPUART1 clock enable during sleep mode               bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SMEN</name>
                     <description>UART2 clock enable during sleep mode               bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2SMEN</name>
                     <description>SPI2 clock enable during sleep mode               bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGSMEN</name>
                     <description>Window watchdog clock enable during               sleep mode bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM6SMEN</name>
                     <description>Timer 6 clock enable during sleep mode               bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM2SMEN</name>
                     <description>Timer2 clock enable during sleep mode               bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM3SMEN</name>
                     <description>Timer3 clock enable during Sleep mode               bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM7SMEN</name>
                     <description>Timer 7 clock enable during Sleep mode               bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART4SMEN</name>
                     <description>USART4 clock enable during Sleep mode               bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART5SMEN</name>
                     <description>USART5 clock enable during Sleep mode               bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SMEN</name>
                     <description>2C3 clock enable during Sleep mode               bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCIPR</name>
               <displayName>CCIPR</displayName>
               <description>Clock configuration register</description>
               <addressOffset>0x4C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>HSI48MSEL</name>
                     <description>48 MHz HSI48 clock source selection               bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1SEL1</name>
                     <description>Low Power Timer clock source selection               bits</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1SEL0</name>
                     <description>LPTIM1SEL0</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL1</name>
                     <description>I2C1 clock source selection               bits</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1SEL0</name>
                     <description>I2C1SEL0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SEL1</name>
                     <description>LPUART1 clock source selection               bits</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPUART1SEL0</name>
                     <description>LPUART1SEL0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SEL1</name>
                     <description>USART2 clock source selection               bits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2SEL0</name>
                     <description>USART2SEL0</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SEL1</name>
                     <description>USART1 clock source selection               bits</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART1SEL0</name>
                     <description>USART1SEL0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3SEL</name>
                     <description>I2C3 clock source selection               bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
