platformio/platform-ststm32/misc/svd/STM32L062.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DBGMCU</name>
         <description>Debug support</description>
         <groupName>DBGMCU</groupName>
         <baseAddress>0x40015800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IDCODE</name>
               <displayName>IDCODE</displayName>
               <description>MCU Device ID Code Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DEV_ID</name>
                     <description>Device Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision Identifier</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Debug MCU Configuration           Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_STOP</name>
                     <description>Debug Stop Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STANDBY</name>
                     <description>Debug Standby Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_SLEEP</name>
                     <description>Debug Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1_FZ</name>
               <displayName>APB1_FZ</displayName>
               <description>APB Low Freeze Register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIMER2_STOP</name>
                     <description>Debug Timer 2 stopped when Core is               halted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER6_STOP</name>
                     <description>Debug Timer 6 stopped when Core is               halted</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_RTC_STOP</name>
                     <description>Debug RTC stopped when Core is               halted</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WWDG_STOP</name>
                     <description>Debug Window Wachdog stopped when Core               is halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_IWDG_STOP</name>
                     <description>Debug Independent Wachdog stopped when               Core is halted</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C1_STOP</name>
                     <description>I2C1 SMBUS timeout mode stopped when               core is halted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_I2C2_STOP</name>
                     <description>I2C2 SMBUS timeout mode stopped when               core is halted</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_LPTIMER_STOP</name>
                     <description>LPTIM1 counter stopped when core is               halted</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB2_FZ</name>
               <displayName>APB2_FZ</displayName>
               <description>APB High Freeze Register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0</resetValue>
               <fields>
                  <field>
                     <name>DBG_TIMER21_STOP</name>
                     <description>Debug Timer 21 stopped when Core is               halted</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER22_STO</name>
                     <description>Debug Timer 22 stopped when Core is               halted</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
