platformio/platform-ststm32/misc/svd/STM32L062.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>USB_SRAM</name>
         <description>Universal serial bus full-speed device       interface</description>
         <groupName>USB</groupName>
         <baseAddress>0x40006000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x800</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>EP0R</name>
               <displayName>EP0R</displayName>
               <description>endpoint 0 register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EA</name>
                     <description>Endpoint address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STAT_TX</name>
                     <description>Status bits, for transmission               transfers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_TX</name>
                     <description>Data Toggle, for transmission               transfers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_TX</name>
                     <description>Correct Transfer for               transmission</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_KIND</name>
                     <description>Endpoint kind</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_TYPE</name>
                     <description>Endpoint type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SETUP</name>
                     <description>Setup transaction               completed</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAT_RX</name>
                     <description>Status bits, for reception               transfers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_RX</name>
                     <description>Data Toggle, for reception               transfers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_RX</name>
                     <description>Correct transfer for               reception</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EP1R</name>
               <displayName>EP1R</displayName>
               <description>endpoint 1 register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EA</name>
                     <description>Endpoint address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STAT_TX</name>
                     <description>Status bits, for transmission               transfers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_TX</name>
                     <description>Data Toggle, for transmission               transfers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_TX</name>
                     <description>Correct Transfer for               transmission</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_KIND</name>
                     <description>Endpoint kind</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_TYPE</name>
                     <description>Endpoint type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SETUP</name>
                     <description>Setup transaction               completed</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAT_RX</name>
                     <description>Status bits, for reception               transfers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_RX</name>
                     <description>Data Toggle, for reception               transfers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_RX</name>
                     <description>Correct transfer for               reception</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EP2R</name>
               <displayName>EP2R</displayName>
               <description>endpoint 2 register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EA</name>
                     <description>Endpoint address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STAT_TX</name>
                     <description>Status bits, for transmission               transfers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_TX</name>
                     <description>Data Toggle, for transmission               transfers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_TX</name>
                     <description>Correct Transfer for               transmission</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_KIND</name>
                     <description>Endpoint kind</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_TYPE</name>
                     <description>Endpoint type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SETUP</name>
                     <description>Setup transaction               completed</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAT_RX</name>
                     <description>Status bits, for reception               transfers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_RX</name>
                     <description>Data Toggle, for reception               transfers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_RX</name>
                     <description>Correct transfer for               reception</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EP3R</name>
               <displayName>EP3R</displayName>
               <description>endpoint 3 register</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EA</name>
                     <description>Endpoint address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STAT_TX</name>
                     <description>Status bits, for transmission               transfers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_TX</name>
                     <description>Data Toggle, for transmission               transfers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_TX</name>
                     <description>Correct Transfer for               transmission</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_KIND</name>
                     <description>Endpoint kind</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_TYPE</name>
                     <description>Endpoint type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SETUP</name>
                     <description>Setup transaction               completed</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAT_RX</name>
                     <description>Status bits, for reception               transfers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_RX</name>
                     <description>Data Toggle, for reception               transfers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_RX</name>
                     <description>Correct transfer for               reception</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EP4R</name>
               <displayName>EP4R</displayName>
               <description>endpoint 4 register</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EA</name>
                     <description>Endpoint address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STAT_TX</name>
                     <description>Status bits, for transmission               transfers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_TX</name>
                     <description>Data Toggle, for transmission               transfers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_TX</name>
                     <description>Correct Transfer for               transmission</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_KIND</name>
                     <description>Endpoint kind</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_TYPE</name>
                     <description>Endpoint type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SETUP</name>
                     <description>Setup transaction               completed</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAT_RX</name>
                     <description>Status bits, for reception               transfers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_RX</name>
                     <description>Data Toggle, for reception               transfers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_RX</name>
                     <description>Correct transfer for               reception</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EP5R</name>
               <displayName>EP5R</displayName>
               <description>endpoint 5 register</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EA</name>
                     <description>Endpoint address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STAT_TX</name>
                     <description>Status bits, for transmission               transfers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_TX</name>
                     <description>Data Toggle, for transmission               transfers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_TX</name>
                     <description>Correct Transfer for               transmission</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_KIND</name>
                     <description>Endpoint kind</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_TYPE</name>
                     <description>Endpoint type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SETUP</name>
                     <description>Setup transaction               completed</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAT_RX</name>
                     <description>Status bits, for reception               transfers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_RX</name>
                     <description>Data Toggle, for reception               transfers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_RX</name>
                     <description>Correct transfer for               reception</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EP6R</name>
               <displayName>EP6R</displayName>
               <description>endpoint 6 register</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EA</name>
                     <description>Endpoint address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>STAT_TX</name>
                     <description>Status bits, for transmission               transfers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_TX</name>
                     <description>Data Toggle, for transmission               transfers</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_TX</name>
                     <description>Correct Transfer for               transmission</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_KIND</name>
                     <description>Endpoint kind</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP_TYPE</name>
                     <description>Endpoint type</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SETUP</name>
                     <description>Setup transaction               completed</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STAT_RX</name>
                     <description>Status bits, for reception               transfers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTOG_RX</name>
                     <description>Data Toggle, for reception               transfers</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTR_RX</name>
                     <description>Correct transfer for               reception</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
